# Basics

In [18]:
import numpy as np
import pandas as pd

In [8]:
# Italic-> *hello*

*hello*

In [10]:
# Bold-> **hello**

**hello**

In [11]:
# Bold and Italic-> ***hello***

***hello***

In [13]:
# 1-D Array
myarr = np.array([1,2,3,4])
print(myarr)

[1 2 3 4]

In [15]:
# 2D Array
myarr = np.array([[1,2,3,4]])
print(myarr)

[[1 2 3 4]]

In [17]:
dict1 = {
    "name":['a','b','c','d'],
    "age":[20,24,23,26],
    "iq":[100,92,120,112]
}

In [21]:
df = pd.DataFrame(dict1)
# Will convert to excel sheet

In [22]:
df

  name  age   iq
0    a   20  100
1    b   24   92
2    c   23  120
3    d   26  112

In [25]:
df.to_csv('students.csv', index=False)
# index=False will remove indexing

In [27]:
df.head(2)

  name  age   iq
0    a   20  100
1    b   24   92

In [28]:
df.tail(2)

  name  age   iq
2    c   23  120
3    d   26  112

In [30]:
df.describe()
# Will provide the statistically analysis of numeric data

         age          iq
count   4.00    4.000000
mean   23.25  106.000000
std     2.50   12.436505
min    20.00   92.000000
25%    22.25   98.000000
50%    23.50  106.000000
75%    24.50  114.000000
max    26.00  120.000000

In [31]:
dict2 = pd.read_csv('students.csv')

In [32]:
dict2.head()

  name  age   iq
0    a   20  100
1    b   24   92
2    c   23  120
3    d   26  112

In [35]:
dict2['iq']

0    100
1     92
2    120
3    112
Name: iq, dtype: int64

In [39]:
dict2['iq'][1]=98
# Will give the warning to not to change data like this

C:\Users\prajwal\AppData\Local\Temp\ipykernel_12632\1052867100.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dict2['iq'][1]=98

In [40]:
dict2

  name  age   iq
0    a   20  100
1    b   24   98
2    c   23  120
3    d   26  112

In [42]:
dict2.index=['student1', 'student2', 'student3', 'student4']

In [44]:
dict2

         name  age   iq
student1    a   20  100
student2    b   24   98
student3    c   23  120
student4    d   26  112